AADE_Legal_Entities_Information_main/Resources/request_version.xml

<soap:Envelope xmlns:soap="http://www.w3.org/2003/05/soap-envelope" xmlns:rgw="http://rgwspublic2/RgWsPublic2Service">
   <soap:Header/>
   <soap:Body>
      <rgw:rgWsPublic2VersionInfo/>
   </soap:Body>
</soap:Envelope>